x = "S S \nL L \nl l \ns s \n_________ \n"

print(len(x)) #Показывает количество символов в строке x
print(x.count ('l')) #Считает сколько символов l  в строке x
print(x.capitalize()) #Первая буква в строке x большая остальные маленькие
print(x.upper()) #Все буквы в строке большие
print(x.lower()) #Все буквы в строке маленькие
print(x) #
print(x.islower()) #Проверяет все ли буквы маленькие
print(x.isupper()) #Проверяет все ли буквы большие
print(x.find ('l')) #Показывает индекс первой найденной буквы l в строке

#Показывает индекс первой найденной буквы l в строке
# начиная с 11 по 13 индекс символа
print(x.find ('l', 11, 13))

#Все эти базовые функции возвращают новую строку,
# а не изменяют уже существующую
