x = "123abc"

print(x.isalnum()) #Проверяет нету ли спец символов в строке
# типо (!@#$)

print(x.isalpha()) #Проверяет наличие элементов не букв в строке (если есть
# то выдает False)

print("  ".isspace()) #Состоит ли строка только из пробелов

print("yyffyyffyy".strip('y')) #Удаляет символ(ы) в () с начала и конца строки

print("Hello".startswith('H')) #Проверяет начинается ли строка с символа в ()
print("Hello".endswith('h')) #Проверяет заканчивается ли строка с символа в ()

print("Hello".split('l')) #Разделяет строку до символа в () и после (Символ
# в скобках удаляется)

print("12; 3; 5".split(';'))


print("x is not y".partition('is')) #Разделяет строку по слову(символу) и
# создает массив из символов до символа в () из символа в() и после него
