x = [3, 3, 4, 5, 1, 78, 2, 34, 65] # Обычный список

x.reverse() # Обратный порядок элементов в списке

print(x)

x.sort() # Быстрая сортировка

print(x)

x.sort(reverse=True) # Обратная быстрая сортировка

print (x)

x.pop() # Удаление последнего элемента, можно указать индекс в ()

print(x)

x.append(2) # Добавляет элемент в конец списка

print(x)

x.insert(1, 22) # Добавляет элемент по индексу

print(x)

print(x.index(4)) # Выводит индекс элемента

print(x.count(3)) # Считает сколько таких элементов в списке

y = x.copy() # Копирует список

print(x)
print(y)

x.clear() # Очищает список

print(x)
print(y)
